# St7SetPropertyTable

Assigns a table to the specified property.

Strand7 API Manual

long St7SetPropertyTable(long uID, long PropTableType, long PropNum,

long TableID)

Input Parameters

uID

Strand7 model file ID.

PropTableType

Property table type; see Table Types.

PropNum

Property number.

TableID

Table ID number, or 0 for none.